[{"model": "api.project", "pk": 1, "fields": {"title": "Daria Aesthetics", "description": "I built a full-stack website for a small aesthetics business in Vancouver, BC. I see technology as an opportunity to empower individuals, and I was inspired by the owner's personal journey. There are countless resources to build websites, but they're either bland or the useful features are locked behind paywalls. I had the time and skills to make a difference.\r\nI reached out to the owner, offered my services, and worked with her over the next few months—I handled the technical side while she injected her creativity and passion.\r\nThe site features real-time appointment booking integrated with Square APIs, service management, and secure payment handling. Built with Node.js, Express, and Docker, with OAuth 2.0 authentication and HTTPS for security.", "technologies": "HTML, CSS, Javascript, Node.js, Express.js, Rest API, OAuth 2.0 Docker, Git", "github_url": "https://github.com/b-lol/DariaAesthetics", "live_url": "https://dariaaesthetics.ca/", "image_url": "", "video_url": "", "order": 2, "created_at": "2026-01-18T17:33:17.208Z"}}, {"model": "api.project", "pk": 2, "fields": {"title": "Impostor-Game", "description": "I built this game for my sisters. We were hanging out and they wanted to play Impostor, but the existing iOS apps weren't cutting it—poor randomization that left players out, limited word selection, and missing features they wanted.\r\nSo I built my own. It's a social deduction word game where players try to identify a hidden impostor through contextual clue-giving rounds. Key features include custom category support powered by Claude AI (so you can play with themes like \"Christmas\" or \"Movies\"), real-time multiplayer via WebSockets, and a full lobby/voting system.\r\nBuilt with Flutter/Dart on the frontend and Python/FastAPI on the backend.", "technologies": "Flutter, Dart, Python, FastAPI, WebSockets, Anthropic Claude API, REST API", "github_url": "https://github.com/b-lol/impostor-game", "live_url": "", "image_url": "", "video_url": "", "order": 3, "created_at": "2026-01-18T17:42:14.904Z"}}, {"model": "api.project", "pk": 3, "fields": {"title": "Portfolio", "description": "You're looking at it! This is a website to display my curated tech solutions. This project was originally done to help me find a co-op/internship. But its quickly become my digital home. As I create more projects and solve more problems, I will connect them  here presenting my solutions for the world to benefit.", "technologies": "Python, Django, React", "github_url": "", "live_url": "", "image_url": "", "video_url": "", "order": 1, "created_at": "2026-01-18T18:08:44.985Z"}}]
